Documents/УправлениеРегиональнымиСубсидиями.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>УправлениеРегиональнымиСубсидиями</Name>
			<BasedOn>
				<xr:Item>Catalog.ЛицевыеСчета</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.НазначенныеРегиональныеСубсидии</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачиДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Субсидии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСубсидии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГраницаСубсидии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/УправлениеРегиональнымиСубсидиями/Ext/ManagerModule.bsl
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаУправлениеСубсидиями, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	 "ВЫБРАТЬ
	 |	Субсидии.ЛицевойСчет,
	 |	Субсидии.Услуга,
	 |	Субсидии.Период,
	 |	Субсидии.Действует,
	 |	Субсидии.СуммаРегиональнойСубсидии,
	 |	Субсидии.ГраницаСубсидии
	 |ИЗ
	 |	(ВЫБРАТЬ
	 |		СубсидииНачало.ЛицевойСчет КАК ЛицевойСчет,
	 |		СубсидииНачало.Услуга КАК Услуга,
	 |		СубсидииНачало.Период КАК Период,
	 |		СубсидииНачало.Действует КАК Действует,
	 |		СубсидииНачало.СуммаРегиональнойСубсидии КАК СуммаРегиональнойСубсидии,
	 |		СубсидииНачало.ГраницаСубсидии КАК ГраницаСубсидии
	 |	ИЗ
	 |		(ВЫБРАТЬ
	 |			УправлениеСубсидиями.Ссылка.ЛицевойСчет КАК ЛицевойСчет,
	 |			УправлениеСубсидиями.Услуга КАК Услуга,
	 |			УправлениеСубсидиями.Ссылка.ДатаНачала КАК Период,
	 |			ИСТИНА КАК Действует,
	 |			УправлениеСубсидиями.СуммаСубсидии КАК СуммаРегиональнойСубсидии,
	 |			УправлениеСубсидиями.ГраницаСубсидии КАК ГраницаСубсидии
	 |		ИЗ
	 |			Документ.УправлениеРегиональнымиСубсидиями.Субсидии КАК УправлениеСубсидиями
	 |		ГДЕ
	 |			УправлениеСубсидиями.Ссылка.ДатаНачала <> &ПустаяДата
	 |			И УправлениеСубсидиями.Ссылка = &Ссылка) КАК СубсидииНачало
	 |	
	 |	ОБЪЕДИНИТЬ ВСЕ
	 |	
	 |	ВЫБРАТЬ
	 |		СубсидииОкончание.ЛицевойСчет,
	 |		СубсидииОкончание.Услуга,
	 |		СубсидииОкончание.Период,
	 |		СубсидииОкончание.Действует,
	 |		СубсидииОкончание.СуммаРегиональнойСубсидии,
	 |		СубсидииОкончание.ГраницаСубсидии
	 |	ИЗ
	 |		(ВЫБРАТЬ
	 |			УправлениеСубсидиями.Ссылка.ЛицевойСчет КАК ЛицевойСчет,
	 |			УправлениеСубсидиями.Услуга КАК Услуга,
	 |			КОНЕЦПЕРИОДА(УправлениеСубсидиями.Ссылка.ДатаОкончания, ДЕНЬ) КАК Период,
	 |			ЛОЖЬ КАК Действует,
	 |			УправлениеСубсидиями.СуммаСубсидии КАК СуммаРегиональнойСубсидии,
	 |			УправлениеСубсидиями.ГраницаСубсидии КАК ГраницаСубсидии
	 |		ИЗ
	 |			Документ.УправлениеРегиональнымиСубсидиями.Субсидии КАК УправлениеСубсидиями
	 |		ГДЕ
	 |			УправлениеСубсидиями.Ссылка.ДатаОкончания <> &ПустаяДата
	 |			И УправлениеСубсидиями.Ссылка = &Ссылка) КАК СубсидииОкончание) КАК Субсидии";
	 
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаУправлениеСубсидиями);
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаНазначенныеРегиональныеСубсидии", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры
